
# 7. დაწერეთ პროგრამა, რომელის გაშვების შემდეგ კლავიატურიდან შეყვანილ
# ინფორმაციას ჩავწერთ data.txt ფაილში ცალ-ცალკე ხაზზე. დავასრულოთ შეტანა 0-ით.

with open("data.txt", "w", encoding="utf-8") as f7:
    while True:
        h = input("enter any info: ")
        if h == "0":
            break
        f7.write(h + "\n")

# 8. დაწერეთ პროგრამა, რომლის მეშვეობით ერთი ფაილიდან წაიკითხავთ კონტენტს.
# ჩაწერეთ მთლიანი კონტენტი მეორე (ახალ) ფაილში ერთ ხაზზე. მითითება: თუ
# პირველ ფაილში არის 3 სტრიქონი, ახალ ფაილში ჩაწერეთ ერთ სტრიქონზე და
# გამოყავით სივრცით.
with open("file8.txt", "r", encoding="utf-8") as f8:
    content = f8.readlines()
with open("file9.txt", "w", encoding="utf-8") as f9:
    line = " ".join(line.strip() for line in content)
    f9.write(line)














# 8. დაწერეთ პროგრამა, რომლის მეშვეობით ერთი ფაილიდან წაიკითხავთ კონტენტს.
# ჩაწერეთ მთლიანი კონტენტი მეორე (ახალ) ფაილში ერთ ხაზზე. მითითება: თუ
# პირველ ფაილში არის 3 სტრიქონი, ახალ ფაილში ჩაწერეთ ერთ სტრიქონზე და
# გამოყავით სივრცით.