# 1. დაწერეთ პროგრამა, რომლის მეშვეობით შექმნით ფაილს იმავე
# დირექტორიაში (საქაღალდეში), ჩაწერეთ მასში ნებისმიერი ტექსტი და
# დახურეთ ფაილი.
c = "ნებისმიერი ტექსტი და დახურეთ ფაილი."
with open("files.txt", "w", encoding="utf-8") as f:
    f.write(c)
# 2. დაწერეთ პროგრამა, რომლის მეშვეობით გახსნით ფაილს, წაიკითხავთ
# კონტენტს და დაბეჭდავთ ეკრანზე. დაითვალეთ სიმბოლოების რაოდენობა
# ფაილში.
with open("files.txt", encoding="utf-8") as f2:
    print(f2.readlines())
    f2.seek(0)
    b = str(f2.readlines())
# 3. დაწერეთ პროგრამა, რომლის მეშვეობით გახსნით უკვე არსებულ ფაილს და
# ბოლოში დაამატეთ თქვენთვის სასურველი ტექსტი.
f3 = open("files.txt", "a+", encoding="utf-8")
f3.write(" ჯასურბეკი")
f3.seek(0)
a = str(f3.readlines())
# 4. დაწერეთ პროგრამა რომელიც წაიკითხავს ინფორმაციას ერთი ფაილიდან
# და ჩააკოპირებს მეორე (ახალ) ფაილში (შეამოწმეთ ქართულ უნიკოდზეც).
with open("files2.txt", "w", encoding="UTF-8") as f4:
       f4.write(a)
# 5. დაწერეთ პროგრამა, რომლის მეშვეობით, ორი ფაილის კონტენტს
# გააერთიანებთ მესამე (ახალ) ფაილში.
with open("files3.txt", "a", encoding="utf-8") as f5:
    f5.write(a + b)
# 6. დაწერეთ პროგრამა რომელიც წაიკითხავს ტექსტს ფაილიდან და დაბეჭდავს
# ეკრანზე მაღალ რეგისტრში.
with open("files6.txt", encoding="utf-8") as f6:
    n = f6.readlines()
    print(str(n).upper())
# 7. დაწერეთ პროგრამა, რომელის გაშვების შემდეგ კლავიატურიდან შეყვანილ
# ინფორმაციას ჩავწერთ data.txt ფაილში ცალ-ცალკე ხაზზე. დავასრულოთ შეტანა 0-ით.
h = input("enter any info: ")
with open("data.txt", "w", encoding="utf-8") as f7:
    print(f7.write(h)+("\n")







